data/Parm_PH_29/alpha_15/alpha_15_13929_4048/0/U_LES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U_LES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector>
15600
(
(0.03649162 -0.00010194 0.00000000)
(0.03697218 -0.00027426 0.00000000)
(0.01106677 -0.00016415 0.00000000)
(0.00004775 0.00014996 0.00000000)
(-0.00467915 0.00009785 0.00000000)
(-0.00587102 0.00252762 0.00000000)
(-0.00607985 0.00381820 0.00000000)
(-0.00755123 0.00484433 0.00000000)
...
)
;

boundaryField
{
    bottomWall
    {
        type        fixedValue;
        value       uniform (0 0 0);
    }
    topWall
    {
        type        fixedValue;
        value       uniform (0 0 0);
    }
    inlet_half0
    {
        type        cyclic;
    }
    inlet_half1
    {
        type        cyclic;
    }
    outlet_half0
    {
        type        cyclic;
    }
    outlet_half1
    {
        type        cyclic;
    }
    sideRight_half0
    {
        type        empty;
    }
    sideRight_half1
    {
        type        empty;
    }
    sideLeft_half0
    {
        type        empty;
    }
    sideLeft_half1
    {
        type        empty;
    }
}

// ************************************************************************* //
