data/Parm_PH_29/alpha_15/alpha_15_13929_4048/0/tauij_LES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      tauij_LES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<symmTensor>
15600
(
(0.00316724 -0.00003001 0.00000000 0.00000896 0.00000000 0.00134494)
(0.00357220 -0.00003957 0.00000000 0.00001286 0.00000000 0.00143250)
(0.00079638 -0.00000210 0.00000000 -0.00000153 0.00000000 0.00028688)
(0.00058088 -0.00001429 0.00000000 -0.00001715 0.00000000 0.00030833)
(0.00060293 -0.00000676 0.00000000 0.00002012 0.00000000 0.00106130)
(0.00100607 -0.00051764 0.00000000 0.00025675 0.00000000 0.00150556)
(0.00061934 -0.00042548 0.00000000 0.00027737 0.00000000 0.00104219)
(0.00068020 -0.00043737 0.00000000 0.00027621 0.00000000 0.00074877)
...
)
;

boundaryField
{
    bottomWall
    {
        type        fixedValue;
        value       uniform (0 0 0 0 0 0);
    }
    topWall
    {
        type        fixedValue;
        value       uniform (0 0 0 0 0 0);
    }
    inlet_half0
    {
        type        cyclic;
    }
    inlet_half1
    {
        type        cyclic;
    }
    outlet_half0
    {
        type        cyclic;
    }
    outlet_half1
    {
        type        cyclic;
    }
    sideRight_half0
    {
        type        empty;
    }
    sideRight_half1
    {
        type        empty;
    }
    sideLeft_half0
    {
        type        empty;
    }
    sideLeft_half1
    {
        type        empty;
    }
}

// ************************************************************************* //
